server/app/controllers/auth_controller.rb

  def signup
    user = User.new(user_params)

    if user.save
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "eddymurphy@gmail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2024-11-30 16:14:45.637464"], ["updated_at", "2024-11-30 16:14:45.637464"]]