server/app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("title", "description", "completed", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "hello"], ["description", nil], ["completed", nil], ["user_id", 1], ["created_at", "2024-11-30 17:34:06.722045"], ["updated_at", "2024-11-30 17:34:06.722045"]]
---
  def create
    @task = @current_user.tasks.build(task_params)
    if @task.save

UPDATE "tasks" SET "title" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["title", "good-work"], ["updated_at", "2024-11-30 17:35:21.001935"], ["id", 6]]
---
  def update
    if @task.update(task_params)

SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ? AND "tasks"."id" = ? LIMIT ?  [["user_id", 1], ["id", 3], ["LIMIT", 1]]
---
  def set_task
    @task = @current_user.tasks.find(params[:id])